In [7]:
import pandas as pd

In [8]:
drop = pd.read_csv('drop_or_grad.csv')
drop

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,1,8,5,2,1,1,1,13,10,6,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,1,6,1,11,1,1,1,1,3,4,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,1,1,5,5,1,1,1,22,27,10,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,1,8,2,15,1,1,1,23,27,6,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,2,12,1,3,0,1,1,22,28,10,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4419,1,1,6,15,1,1,1,1,1,6,...,0,6,8,5,12.666667,0,15.5,2.8,-4.06,Graduate
4420,1,1,2,15,1,1,19,1,1,10,...,0,6,6,2,11.000000,0,11.1,0.6,2.02,Dropout
4421,1,1,1,12,1,1,1,22,27,10,...,0,8,9,1,13.500000,0,13.9,-0.3,0.79,Dropout
4422,1,1,1,9,1,1,1,22,27,8,...,0,5,6,5,12.000000,0,9.4,-0.8,-3.12,Graduate
4423,1,5,1,15,1,1,9,23,27,6,...,0,6,6,6,13.000000,0,12.7,3.7,-1.70,Graduate

In [9]:
drop.isnull().sum() #checking for null values

Marital status                                    0
Application mode                                  0
Application order                                 0
Course                                            0
Daytime/evening attendance                        0
Previous qualification                            0
Nacionality                                       0
Mother's qualification                            0
Father's qualification                            0
Mother's occupation                               0
Father's occupation                               0
Displaced                                         0
Educational special needs                         0
Debtor                                            0
Tuition fees up to date                           0
Gender                                            0
Scholarship holder                                0
Age at enrollment                                 0
International                                     0
Curricular units 1st sem (credited)               0
Curricular units 1st sem (enrolled)               0
Curricular units 1st sem (evaluations)            0
Curricular units 1st sem (approved)               0
Curricular units 1st sem (grade)                  0
Curricular units 1st sem (without evaluations)    0
Curricular units 2nd sem (credited)               0
Curricular units 2nd sem (enrolled)               0
Curricular units 2nd sem (evaluations)            0
Curricular units 2nd sem (approved)               0
Curricular units 2nd sem (grade)                  0
Curricular units 2nd sem (without evaluations)    0
Unemployment rate                                 0
Inflation rate                                    0
GDP                                               0
Target                                            0
dtype: int64

In [10]:
drop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 35 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Marital status                                  4424 non-null   int64
 1   Application mode                                4424 non-null   int64
 2   Application order                               4424 non-null   int64
 3   Course                                          4424 non-null   int64
 4   Daytime/evening attendance                      4424 non-null   int64
 5   Previous qualification                          4424 non-null   int64
 6   Nacionality                                     4424 non-null   int64
 7   Mother's qualification                          4424 non-null   int64
 8   Father's qualification                          4424 non-null   int64
 9   Mother's occupation                             4424 non-null   int64
 10  Father's occupation                             4424 non-null   int64
 11  Displaced                                       4424 non-null   int64
 12  Educational special needs                       4424 non-null   int64
 13  Debtor                                          4424 non-null   int64
 14  Tuition fees up to date                         4424 non-null   int64
 15  Gender                                          4424 non-null   int64
 16  Scholarship holder                              4424 non-null   int64
 17  Age at enrollment                               4424 non-null   int64
 18  International                                   4424 non-null   int64
 19  Curricular units 1st sem (credited)             4424 non-null   int64
 20  Curricular units 1st sem (enrolled)             4424 non-null   int64
 21  Curricular units 1st sem (evaluations)          4424 non-null   int64
 22  Curricular units 1st sem (approved)             4424 non-null   int64
 23  Curricular units 1st sem (grade)                4424 non-null   float64
 24  Curricular units 1st sem (without evaluations)  4424 non-null   int64
 25  Curricular units 2nd sem (credited)             4424 non-null   int64
 26  Curricular units 2nd sem (enrolled)             4424 non-null   int64
 27  Curricular units 2nd sem (evaluations)          4424 non-null   int64
 28  Curricular units 2nd sem (approved)             4424 non-null   int64
 29  Curricular units 2nd sem (grade)                4424 non-null   float64
 30  Curricular units 2nd sem (without evaluations)  4424 non-null   int64
 31  Unemployment rate                               4424 non-null   float64
 32  Inflation rate                                  4424 non-null   float64
 33  GDP                                             4424 non-null   float64
 34  Target                                          4424 non-null   object
dtypes: float64(5), int64(29), object(1)
memory usage: 1.2+ MB

In [56]:

drop['Marital status'] = drop['Marital status'].replace(2, 'married')
drop['Marital status'] = drop['Marital status'].replace(3, 'widower')
drop['Marital status'] = drop['Marital status'].replace(4, 'divorced')
drop['Marital status'] = drop['Marital status'].replace(5, 'facto union')
drop['Marital status'] = drop['Marital status'].replace(6, 'legally separated')

In [57]:
drop.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,single,8,5,2,1,high school only,european,some college,no high school,service,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,single,6,1,11,1,high school only,european,post grad degree,post grad degree,STEM,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,single,1,5,5,1,high school only,european,no high school,no high school,trade,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,single,8,2,15,1,high school only,european,some college,post grad degree,service,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,married,12,1,3,0,high school only,european,no high school,no high school,trade,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [58]:
drop['Nacionality'] = drop['Nacionality'].replace(1, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(2, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(3, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(4, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(5, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(6, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(7, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(8, 'african')
drop['Nacionality'] = drop['Nacionality'].replace(9, 'african')
drop['Nacionality'] = drop['Nacionality'].replace(10, 'african')
drop['Nacionality'] = drop['Nacionality'].replace(11, 'african')
drop['Nacionality'] = drop['Nacionality'].replace(12, 'african')
drop['Nacionality'] = drop['Nacionality'].replace(13, 'middle-eastern')
drop['Nacionality'] = drop['Nacionality'].replace(14, 'latino')
drop['Nacionality'] = drop['Nacionality'].replace(15, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(16, 'european')
drop['Nacionality'] = drop['Nacionality'].replace(17, 'latino')
drop['Nacionality'] = drop['Nacionality'].replace(18, 'asian')
drop['Nacionality'] = drop['Nacionality'].replace(19, 'asian')
drop['Nacionality'] = drop['Nacionality'].replace(20, 'latino')
drop['Nacionality'] = drop['Nacionality'].replace(21, 'latino')

In [59]:
drop['Previous qualification'] = drop['Previous qualification'].replace(1, 'high school only')
drop['Previous qualification'] = drop['Previous qualification'].replace(2, 'bachelor\'s degree')
drop['Previous qualification'] = drop['Previous qualification'].replace(3, 'bachelor\'s degree')
drop['Previous qualification'] = drop['Previous qualification'].replace(4, 'post grad degree')
drop['Previous qualification'] = drop['Previous qualification'].replace(5, 'post grad degree')
drop['Previous qualification'] = drop['Previous qualification'].replace(6, 'some college')
drop['Previous qualification'] = drop['Previous qualification'].replace(7, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(8, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(9, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(10, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(11, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(12, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(13, 'no high school')
drop['Previous qualification'] = drop['Previous qualification'].replace(14, 'some college')
drop['Previous qualification'] = drop['Previous qualification'].replace(15, 'bachelor\'s degree')
drop['Previous qualification'] = drop['Previous qualification'].replace(16, 'some college')
drop['Previous qualification'] = drop['Previous qualification'].replace(17, 'post grad degree')

In [60]:
drop.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,single,8,5,2,1,high school only,european,some college,no high school,service,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,single,6,1,11,1,high school only,european,post grad degree,post grad degree,STEM,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,single,1,5,5,1,high school only,european,no high school,no high school,trade,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,single,8,2,15,1,high school only,european,some college,post grad degree,service,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,married,12,1,3,0,high school only,european,no high school,no high school,trade,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [61]:
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(1,'high school only')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(2,'bachelor\'s degree')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(3,'bachelor\'s degree')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(4,'post grad degree')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(5,'post grad degree')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(6,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(7,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(8,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(9,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(10,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(11,'no high school ')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(12,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(13,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(14,'high school only')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(15,'high school only')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(16,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(17,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(18,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(19,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(20,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(21,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(22,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(23,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(24,'unknown')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(25,'illiterate')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(26,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(27,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(28,'no high school')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(29,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(30,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(31,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(32,'some college')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(33,'post grad degree')
drop['Mother\'s qualification'] = drop['Mother\'s qualification'].replace(34,'post grad degree')

In [62]:
drop.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,single,8,5,2,1,high school only,european,some college,no high school,service,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,single,6,1,11,1,high school only,european,post grad degree,post grad degree,STEM,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,single,1,5,5,1,high school only,european,no high school,no high school,trade,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,single,8,2,15,1,high school only,european,some college,post grad degree,service,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,married,12,1,3,0,high school only,european,no high school,no high school,trade,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [63]:
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(1,'high school only')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(2,'bachelor\'s degree')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(3,'bachelor\'s degree')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(4,'post grad degree')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(5,'post grad degree')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(6,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(7,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(8,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(9,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(10,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(11,'no high school ')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(12,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(13,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(14,'high school only')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(15,'high school only')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(16,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(17,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(18,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(19,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(20,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(21,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(22,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(23,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(24,'unknown')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(25,'illiterate')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(26,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(27,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(28,'no high school')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(29,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(30,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(31,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(32,'some college')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(33,'post grad degree')
drop['Father\'s qualification'] = drop['Father\'s qualification'].replace(34,'post grad degree')

In [64]:
drop.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,single,8,5,2,1,high school only,european,some college,no high school,service,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,single,6,1,11,1,high school only,european,post grad degree,post grad degree,STEM,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,single,1,5,5,1,high school only,european,no high school,no high school,trade,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,single,8,2,15,1,high school only,european,some college,post grad degree,service,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,married,12,1,3,0,high school only,european,no high school,no high school,trade,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [65]:
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(1,'education')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(2,'law')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(3,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(4,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(5,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(6,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(7,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(8,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(9, 'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(10,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(11,'military')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(12,'none')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(13,'military')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(14,'military')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(15,'military')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(16,'military')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(17,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(18,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(19,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(20,'health')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(21,'education')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(22,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(23,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(24,'unknown')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(25,'health')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(26,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(27,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(28,'STEM')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(29,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(30,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(31,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(32,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(33,'law')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(34,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(35,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(36,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(37,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(38,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(39,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(40,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(41,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(42,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(43,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(44,'trade')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(45,'service')
drop['Mother\'s occupation'] = drop['Mother\'s occupation'].replace(46,'service')

In [66]:
drop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 35 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Marital status                                  4424 non-null   object
 1   Application mode                                4424 non-null   int64
 2   Application order                               4424 non-null   int64
 3   Course                                          4424 non-null   int64
 4   Daytime/evening attendance                      4424 non-null   int64
 5   Previous qualification                          4424 non-null   object
 6   Nacionality                                     4424 non-null   object
 7   Mother's qualification                          4424 non-null   object
 8   Father's qualification                          4424 non-null   object
 9   Mother's occupation                             4424 non-null   object
 10  Father's occupation                             4424 non-null   object
 11  Displaced                                       4424 non-null   int64
 12  Educational special needs                       4424 non-null   int64
 13  Debtor                                          4424 non-null   int64
 14  Tuition fees up to date                         4424 non-null   int64
 15  Gender                                          4424 non-null   int64
 16  Scholarship holder                              4424 non-null   int64
 17  Age at enrollment                               4424 non-null   int64
 18  International                                   4424 non-null   int64
 19  Curricular units 1st sem (credited)             4424 non-null   int64
 20  Curricular units 1st sem (enrolled)             4424 non-null   int64
 21  Curricular units 1st sem (evaluations)          4424 non-null   int64
 22  Curricular units 1st sem (approved)             4424 non-null   int64
 23  Curricular units 1st sem (grade)                4424 non-null   float64
 24  Curricular units 1st sem (without evaluations)  4424 non-null   int64
 25  Curricular units 2nd sem (credited)             4424 non-null   int64
 26  Curricular units 2nd sem (enrolled)             4424 non-null   int64
 27  Curricular units 2nd sem (evaluations)          4424 non-null   int64
 28  Curricular units 2nd sem (approved)             4424 non-null   int64
 29  Curricular units 2nd sem (grade)                4424 non-null   float64
 30  Curricular units 2nd sem (without evaluations)  4424 non-null   int64
 31  Unemployment rate                               4424 non-null   float64
 32  Inflation rate                                  4424 non-null   float64
 33  GDP                                             4424 non-null   float64
 34  Target                                          4424 non-null   object
dtypes: float64(5), int64(22), object(8)
memory usage: 1.2+ MB

In [67]:
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(1,'education')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(2,'law')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(3,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(4,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(5,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(6,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(7,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(8,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(9,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(10,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(11,'military')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(12,'none')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(13,'military')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(14,'military')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(15,'military')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(16,'military')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(17,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(18,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(19,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(20,'health')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(21,'education')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(22,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(23,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(24,'unknown')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(26,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(27,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(28,'STEM')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(29,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(30,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(31,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(32,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(33,'law')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(34,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(35,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(36,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(37,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(38,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(39,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(40,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(41,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(42,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(43,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(44,'trade')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(45,'service')
drop['Father\'s occupation'] = drop['Father\'s occupation'].replace(46,'service')

In [68]:
drop.head()

,Marital status,Application mode,Application order,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,...,Curricular units 2nd sem (credited),Curricular units 2nd sem (enrolled),Curricular units 2nd sem (evaluations),Curricular units 2nd sem (approved),Curricular units 2nd sem (grade),Curricular units 2nd sem (without evaluations),Unemployment rate,Inflation rate,GDP,Target
0,single,8,5,2,1,high school only,european,some college,no high school,service,...,0,0,0,0,0.000000,0,10.8,1.4,1.74,Dropout
1,single,6,1,11,1,high school only,european,post grad degree,post grad degree,STEM,...,0,6,6,6,13.666667,0,13.9,-0.3,0.79,Graduate
2,single,1,5,5,1,high school only,european,no high school,no high school,trade,...,0,6,0,0,0.000000,0,10.8,1.4,1.74,Dropout
3,single,8,2,15,1,high school only,european,some college,post grad degree,service,...,0,6,10,5,12.400000,0,9.4,-0.8,-3.12,Graduate
4,married,12,1,3,0,high school only,european,no high school,no high school,trade,...,0,6,6,6,13.000000,0,13.9,-0.3,0.79,Graduate

In [74]:
drop = drop.drop(drop.columns[[19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29 ,30]], axis = 1)

In [76]:
drop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4424 entries, 0 to 4423
Data columns (total 23 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Marital status              4424 non-null   object
 1   Application mode            4424 non-null   int64
 2   Application order           4424 non-null   int64
 3   Course                      4424 non-null   int64
 4   Daytime/evening attendance  4424 non-null   int64
 5   Previous qualification      4424 non-null   object
 6   Nacionality                 4424 non-null   object
 7   Mother's qualification      4424 non-null   object
 8   Father's qualification      4424 non-null   object
 9   Mother's occupation         4424 non-null   object
 10  Father's occupation         4424 non-null   object
 11  Displaced                   4424 non-null   int64
 12  Educational special needs   4424 non-null   int64
 13  Debtor                      4424 non-null   int64
 14  Tuition fees up to date     4424 non-null   int64
 15  Gender                      4424 non-null   int64
 16  Scholarship holder          4424 non-null   int64
 17  Age at enrollment           4424 non-null   int64
 18  International               4424 non-null   int64
 19  Unemployment rate           4424 non-null   float64
 20  Inflation rate              4424 non-null   float64
 21  GDP                         4424 non-null   float64
 22  Target                      4424 non-null   object
dtypes: float64(3), int64(12), object(8)
memory usage: 795.1+ KB

In [79]:
drop['Course'] = drop['Course'].replace(1, 'agriculture')
drop['Course'] = drop['Course'].replace(2, 'Animation')
drop['Course'] = drop['Course'].replace(3, 'social service')
drop['Course'] = drop['Course'].replace(4, 'agriculture')
drop['Course'] = drop['Course'].replace(5, 'communication')
drop['Course'] = drop['Course'].replace(6, 'nursing')
drop['Course'] = drop['Course'].replace(7, 'engineering')
drop['Course'] = drop['Course'].replace(8, 'agriculture')
drop['Course'] = drop['Course'].replace(9, 'management')
drop['Course'] = drop['Course'].replace(10, 'social service')
drop['Course'] = drop['Course'].replace(11, 'tourism')
drop['Course'] = drop['Course'].replace(12, 'nursing')
drop['Course'] = drop['Course'].replace(13, 'oral hygiene')
drop['Course'] = drop['Course'].replace(14, 'marketing')
drop['Course'] = drop['Course'].replace(15, 'communication')
drop['Course'] = drop['Course'].replace(16, 'education')
drop['Course'] = drop['Course'].replace(17, 'management')

In [82]:
drop = drop.drop(drop.columns[[1,2,11,13,18,19,20,21]], axis = 1)

In [83]:
drop.head()

,Marital status,Course,Daytime/evening attendance,Previous qualification,Nacionality,Mother's qualification,Father's qualification,Mother's occupation,Father's occupation,Educational special needs,Tuition fees up to date,Gender,Scholarship holder,Age at enrollment,Target
0,single,Animation,1,high school only,european,some college,no high school,service,trade,0,1,1,0,20,Dropout
1,single,tourism,1,high school only,european,post grad degree,post grad degree,STEM,STEM,0,0,1,0,19,Graduate
2,single,communication,1,high school only,european,no high school,no high school,trade,trade,0,0,1,0,19,Dropout
3,single,communication,1,high school only,european,some college,post grad degree,service,STEM,0,1,0,0,20,Graduate
4,married,social service,0,high school only,european,no high school,no high school,trade,trade,0,1,0,0,45,Graduate